1s/ERP/Conf/Enums/СхемыРаботыТорговыхПлощадок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СхемыРаботыТорговыхПлощадок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FBO</Name>
					<Comment>Хранение и доставка силами торговой площадки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FBS</Name>
					<Comment>Доставка силами торговой площадки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DBS</Name>
					<Comment>Хранение и доставка силами продавца</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Express</Name>
					<Comment>Исполнение заказа в сжатые сроки</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ВидыМаркетплейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыМаркетплейсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МаркетплейсЯндексМаркет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркетплейсOzon</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркетплейсWildberries</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/СхемыРаботыТорговыхПлощадок/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	УчетнаяЗаписьМаркетплейса =
		ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "УчетнаяЗаписьМаркетплейса", Справочники.УчетныеЗаписиМаркетплейсов.ПустаяСсылка());	// СправочникСсылка.УчетныеЗаписиМаркетплейсов
	ВидМаркетплейса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗаписьМаркетплейса, "ВидМаркетплейса");
	ВидМаркетплейсаПустаяСсылка = ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.ПустаяСсылка");
	
	Если ВидМаркетплейса <> ВидМаркетплейсаПустаяСсылка Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;

		Если ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.МаркетплейсOzon") Тогда
			ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СхемыРаботыТорговыхПлощадок.FBO"), НСтр("ru = 'FBO';
																												|en = 'FBO'"));
			ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СхемыРаботыТорговыхПлощадок.FBS"), НСтр("ru = 'FBS';
																												|en = 'FBS'"));
			ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СхемыРаботыТорговыхПлощадок.DBS"), НСтр("ru = 'RealFBS';
																												|en = 'RealFBS'"));
		ИначеЕсли ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.МаркетплейсЯндексМаркет") Тогда
			ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СхемыРаботыТорговыхПлощадок.FBO"), 	НСтр("ru = 'FBY';
																													|en = 'FBY'"));
			ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СхемыРаботыТорговыхПлощадок.FBS"), 	НСтр("ru = 'FBS';
																													|en = 'FBS'"));
			ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СхемыРаботыТорговыхПлощадок.Express"), НСтр("ru = 'Express';
																													|en = 'Express'"));
			ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СхемыРаботыТорговыхПлощадок.DBS"), 	НСтр("ru = 'DBS';
																													|en = 'DBS'"));
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает представление схемы работы для учетной записи маркетплейса.
//
// Параметры:
//   СхемаРаботы - ПеречислениеСсылка.СхемыРаботыТорговыхПлощадок - схема работы, по которой необходимо получить представление.
//   УчетнаяЗаписьМаркетплейса - СправочникСсылка.УчетныеЗаписиМаркетплейсов - учетная запись для получения представления схемы работы.
//
// Возвращаемое значение:
//   Строка - представление схемы работы.
//
Функция ПредставлениеСхемыРаботы(СхемаРаботы, УчетнаяЗаписьМаркетплейса) Экспорт

	ПараметрыВыбора = Новый Структура("УчетнаяЗаписьМаркетплейса", УчетнаяЗаписьМаркетплейса);
	ДанныеВыбора = ПолучитьДанныеВыбора(ПараметрыВыбора);

	ЗначениеПеречисления = ДанныеВыбора.НайтиПоЗначению(СхемаРаботы);
	Если ЗначениеПеречисления = Неопределено Тогда
		Возврат "";
	КонецЕсли;

	Представление = ?(ПустаяСтрока(ЗначениеПеречисления.Представление),
		Строка(ЗначениеПеречисления.Значение), ЗначениеПеречисления.Представление);

	Возврат Представление;

КонецФункции

#КонецОбласти

#КонецЕсли
